/*
 *  Последовательность.
Вывести последовательность чисел, поступившую на вход.

Входные данные:
На вход программы поступает последовательность целых чисел. Количество чисел в последовательности заранее неизвестно, но зато известно, что в конце последовательности записано число -9999 и в последовательности всегда есть хотя бы одно число.

Выходные данные:
Вывести все элементы последовательности, кроме заключительного -9999, на экран.



Sample Input:

-752 145 -67 402 -905 -109 -759 425 824 658 482 259 -9999

Sample Output:

-752 145 -67 402 -905 -109 -759 425 824 658 482 259
*/

#include <stdio.h>

int main(void) {

  int N=0;

  do {
  scanf("%d", &N);
  if(N != -9999){
    printf("%d ", N);
  }
  }while(N != -9999);
  return 0;
}

/*better code
 * #include <stdio.h>

int main() {
    int a; scanf("%d", &a);
    while (a!=-9999) {
        printf("%d ", a);
        scanf("%d", &a);
    }
}
*/
